<?xml version="1.0"?>
<net name="Model48" version="11">
	<layers>
		<layer id="0" name="Parameter_25362" type="Parameter" version="opset1">
			<data shape="1,2,2,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_25363" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_25364" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_25365" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="32" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_25366" type="Const" version="opset1">
			<data element_type="f32" shape="2" offset="40" size="8" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_25367" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="48" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Interpolate_25368" type="Interpolate" version="opset4">
			<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="asymmetric" nearest_mode="round_prefer_floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_25374" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_25375" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Result_25376" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="4" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="3" />
		<edge from-layer="6" from-port="4" to-layer="8" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
	</edges>
	<rt_info />
</net>
