<?xml version="1.0"?>
<net name="Function_0" version="6" batch="1">
	<layers>
		<layer name="Parameter_0" type="Input" precision="FP32" id="0">
			<data originalLayersNames="Parameter_0" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_4" type="Convolution" precision="FP32" id="1">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" originalLayersNames="Add_4,Convolution_2" output="32" pads_begin="0,0" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="128" precision="FP32" />
				<weights offset="128" size="3456" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_5" type="Clamp" precision="FP32" id="2">
			<data max="6" min="0" originalLayersNames="Clamp_5" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_17" type="Convolution" precision="FP32" id="3">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" originalLayersNames="Add_17,GroupConvolution_15" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3584" size="128" precision="FP32" />
				<weights offset="3712" size="1152" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_18" type="Clamp" precision="FP32" id="4">
			<data max="6" min="0" originalLayersNames="Clamp_18" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_28" type="Convolution" precision="FP32" id="5">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_28,Convolution_26" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4864" size="256" precision="FP32" />
				<weights offset="5120" size="8192" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_29" type="Clamp" precision="FP32" id="6">
			<data max="6" min="0" originalLayersNames="Clamp_29" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_41" type="Convolution" precision="FP32" id="7">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" originalLayersNames="Add_41,GroupConvolution_39" output="64" pads_begin="0,0" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="13312" size="256" precision="FP32" />
				<weights offset="13568" size="2304" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_42" type="Clamp" precision="FP32" id="8">
			<data max="6" min="0" originalLayersNames="Clamp_42" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_52" type="Convolution" precision="FP32" id="9">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_52,Convolution_50" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="15872" size="512" precision="FP32" />
				<weights offset="16384" size="32768" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_53" type="Clamp" precision="FP32" id="10">
			<data max="6" min="0" originalLayersNames="Clamp_53" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_65" type="Convolution" precision="FP32" id="11">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" originalLayersNames="Add_65,GroupConvolution_63" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="49152" size="512" precision="FP32" />
				<weights offset="49664" size="4608" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_66" type="Clamp" precision="FP32" id="12">
			<data max="6" min="0" originalLayersNames="Clamp_66" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_76" type="Convolution" precision="FP32" id="13">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_76,Convolution_74" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="54272" size="512" precision="FP32" />
				<weights offset="54784" size="65536" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_77" type="Clamp" precision="FP32" id="14">
			<data max="6" min="0" originalLayersNames="Clamp_77" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_89" type="Convolution" precision="FP32" id="15">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" originalLayersNames="Add_89,GroupConvolution_87" output="128" pads_begin="1,1" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="120320" size="512" precision="FP32" />
				<weights offset="120832" size="4608" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_90" type="Clamp" precision="FP32" id="16">
			<data max="6" min="0" originalLayersNames="Clamp_90" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_100" type="Convolution" precision="FP32" id="17">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_100,Convolution_98" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="125440" size="1024" precision="FP32" />
				<weights offset="126464" size="131072" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_101" type="Clamp" precision="FP32" id="18">
			<data max="6" min="0" originalLayersNames="Clamp_101" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_113" type="Convolution" precision="FP32" id="19">
			<data auto_pad="same_upper" dilations="1,1" group="256" kernel="3,3" originalLayersNames="Add_113,GroupConvolution_111" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="257536" size="1024" precision="FP32" />
				<weights offset="258560" size="9216" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_114" type="Clamp" precision="FP32" id="20">
			<data max="6" min="0" originalLayersNames="Clamp_114" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_124" type="Convolution" precision="FP32" id="21">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_124,Convolution_122" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="267776" size="1024" precision="FP32" />
				<weights offset="268800" size="262144" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_125" type="Clamp" precision="FP32" id="22">
			<data max="6" min="0" originalLayersNames="Clamp_125" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_137" type="Convolution" precision="FP32" id="23">
			<data auto_pad="same_upper" dilations="1,1" group="256" kernel="3,3" originalLayersNames="Add_137,GroupConvolution_135" output="256" pads_begin="0,0" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="530944" size="1024" precision="FP32" />
				<weights offset="531968" size="9216" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_138" type="Clamp" precision="FP32" id="24">
			<data max="6" min="0" originalLayersNames="Clamp_138" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_148" type="Convolution" precision="FP32" id="25">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_148,Convolution_146" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="541184" size="2048" precision="FP32" />
				<weights offset="543232" size="524288" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_149" type="Clamp" precision="FP32" id="26">
			<data max="6" min="0" originalLayersNames="Clamp_149" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_161" type="Convolution" precision="FP32" id="27">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" originalLayersNames="Add_161,GroupConvolution_159" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1067520" size="2048" precision="FP32" />
				<weights offset="1069568" size="18432" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_162" type="Clamp" precision="FP32" id="28">
			<data max="6" min="0" originalLayersNames="Clamp_162" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_172" type="Convolution" precision="FP32" id="29">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_172,Convolution_170" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1088000" size="2048" precision="FP32" />
				<weights offset="1090048" size="1048576" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_173" type="Clamp" precision="FP32" id="30">
			<data max="6" min="0" originalLayersNames="Clamp_173" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_185" type="Convolution" precision="FP32" id="31">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" originalLayersNames="Add_185,GroupConvolution_183" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2138624" size="2048" precision="FP32" />
				<weights offset="2140672" size="18432" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_186" type="Clamp" precision="FP32" id="32">
			<data max="6" min="0" originalLayersNames="Clamp_186" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_196" type="Convolution" precision="FP32" id="33">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_196,Convolution_194" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2159104" size="2048" precision="FP32" />
				<weights offset="2161152" size="1048576" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_197" type="Clamp" precision="FP32" id="34">
			<data max="6" min="0" originalLayersNames="Clamp_197" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_209" type="Convolution" precision="FP32" id="35">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" originalLayersNames="Add_209,GroupConvolution_207" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3209728" size="2048" precision="FP32" />
				<weights offset="3211776" size="18432" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_210" type="Clamp" precision="FP32" id="36">
			<data max="6" min="0" originalLayersNames="Clamp_210" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_220" type="Convolution" precision="FP32" id="37">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_220,Convolution_218" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3230208" size="2048" precision="FP32" />
				<weights offset="3232256" size="1048576" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_221" type="Clamp" precision="FP32" id="38">
			<data max="6" min="0" originalLayersNames="Clamp_221" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_233" type="Convolution" precision="FP32" id="39">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" originalLayersNames="Add_233,GroupConvolution_231" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4280832" size="2048" precision="FP32" />
				<weights offset="4282880" size="18432" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_234" type="Clamp" precision="FP32" id="40">
			<data max="6" min="0" originalLayersNames="Clamp_234" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_244" type="Convolution" precision="FP32" id="41">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_244,Convolution_242" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4301312" size="2048" precision="FP32" />
				<weights offset="4303360" size="1048576" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_245" type="Clamp" precision="FP32" id="42">
			<data max="6" min="0" originalLayersNames="Clamp_245" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_257" type="Convolution" precision="FP32" id="43">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" originalLayersNames="Add_257,GroupConvolution_255" output="512" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5351936" size="2048" precision="FP32" />
				<weights offset="5353984" size="18432" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_258" type="Clamp" precision="FP32" id="44">
			<data max="6" min="0" originalLayersNames="Clamp_258" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_268" type="Convolution" precision="FP32" id="45">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_268,Convolution_266" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5372416" size="2048" precision="FP32" />
				<weights offset="5374464" size="1048576" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_269" type="Clamp" precision="FP32" id="46">
			<data max="6" min="0" originalLayersNames="Clamp_269" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_279" type="Convolution" precision="FP32" id="47">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_279,Convolution_277" output="273" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>273</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6423040" size="1092" precision="FP32" />
				<weights offset="6424132" size="559104" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Transpose_281" type="Permute" precision="FP32" id="48">
			<data order="0,2,3,1" originalLayersNames="Transpose_281" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>273</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>273</dim>
				</port>
			</output>
		</layer>
		<layer name="Constant_282" type="Const" precision="I64" id="49">
			<data originalLayersNames="Constant_282" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6983236" size="32" precision="I64" />
			</blobs>
		</layer>
		<layer name="Reshape_283" type="Reshape" precision="FP32" id="50">
			<data dim="" originalLayersNames="Reshape_283" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>273</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1083</dim>
					<dim>91</dim>
				</port>
			</output>
		</layer>
		<layer name="Transpose_285" type="Permute" precision="FP32" id="51">
			<data order="0,3,1,2" originalLayersNames="Transpose_285" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1083</dim>
					<dim>91</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>91</dim>
					<dim>1</dim>
					<dim>1083</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_301" type="Convolution" precision="FP32" id="52">
			<data auto_pad="same_upper" dilations="1,1" group="512" kernel="3,3" originalLayersNames="Add_301,GroupConvolution_299" output="512" pads_begin="1,1" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6983268" size="2048" precision="FP32" />
				<weights offset="6985316" size="18432" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_302" type="Clamp" precision="FP32" id="53">
			<data max="6" min="0" originalLayersNames="Clamp_302" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_312" type="Convolution" precision="FP32" id="54">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_312,Convolution_310" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7003748" size="4096" precision="FP32" />
				<weights offset="7007844" size="2097152" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_313" type="Clamp" precision="FP32" id="55">
			<data max="6" min="0" originalLayersNames="Clamp_313" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_325" type="Convolution" precision="FP32" id="56">
			<data auto_pad="same_upper" dilations="1,1" group="1024" kernel="3,3" originalLayersNames="Add_325,GroupConvolution_323" output="1024" pads_begin="1,1" pads_end="1,1" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="9104996" size="4096" precision="FP32" />
				<weights offset="9109092" size="36864" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_326" type="Clamp" precision="FP32" id="57">
			<data max="6" min="0" originalLayersNames="Clamp_326" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_336" type="Convolution" precision="FP32" id="58">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_336,Convolution_334" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="9145956" size="4096" precision="FP32" />
				<weights offset="9150052" size="4194304" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_337" type="Clamp" precision="FP32" id="59">
			<data max="6" min="0" originalLayersNames="Clamp_337" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_347" type="Convolution" precision="FP32" id="60">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_347,Convolution_345" output="546" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>546</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="13344356" size="2184" precision="FP32" />
				<weights offset="13346540" size="2236416" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Transpose_349" type="Permute" precision="FP32" id="61">
			<data order="0,2,3,1" originalLayersNames="Transpose_349" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>546</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>546</dim>
				</port>
			</output>
		</layer>
		<layer name="Constant_350" type="Const" precision="I64" id="62">
			<data originalLayersNames="Constant_350" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="15582956" size="32" precision="I64" />
			</blobs>
		</layer>
		<layer name="Reshape_351" type="Reshape" precision="FP32" id="63">
			<data dim="" originalLayersNames="Reshape_351" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>546</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>600</dim>
					<dim>91</dim>
				</port>
			</output>
		</layer>
		<layer name="Transpose_353" type="Permute" precision="FP32" id="64">
			<data order="0,3,1,2" originalLayersNames="Transpose_353" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>600</dim>
					<dim>91</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>91</dim>
					<dim>1</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_367" type="Convolution" precision="FP32" id="65">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_367,Convolution_365" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="15582988" size="1024" precision="FP32" />
				<weights offset="15584012" size="1048576" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_368" type="Clamp" precision="FP32" id="66">
			<data max="6" min="0" originalLayersNames="Clamp_368" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_378" type="Convolution" precision="FP32" id="67">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" originalLayersNames="Add_378,Convolution_376" output="512" pads_begin="0,0" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<biases offset="16632588" size="2048" precision="FP32" />
				<weights offset="16634636" size="4718592" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_379" type="Clamp" precision="FP32" id="68">
			<data max="6" min="0" originalLayersNames="Clamp_379" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_389" type="Convolution" precision="FP32" id="69">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_389,Convolution_387" output="546" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>546</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<biases offset="21353228" size="2184" precision="FP32" />
				<weights offset="21355412" size="1118208" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Transpose_391" type="Permute" precision="FP32" id="70">
			<data order="0,2,3,1" originalLayersNames="Transpose_391" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>546</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
					<dim>546</dim>
				</port>
			</output>
		</layer>
		<layer name="Constant_392" type="Const" precision="I64" id="71">
			<data originalLayersNames="Constant_392" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="22473620" size="32" precision="I64" />
			</blobs>
		</layer>
		<layer name="Reshape_393" type="Reshape" precision="FP32" id="72">
			<data dim="" originalLayersNames="Reshape_393" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
					<dim>546</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>150</dim>
					<dim>91</dim>
				</port>
			</output>
		</layer>
		<layer name="Transpose_395" type="Permute" precision="FP32" id="73">
			<data order="0,3,1,2" originalLayersNames="Transpose_395" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>150</dim>
					<dim>91</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>91</dim>
					<dim>1</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_409" type="Convolution" precision="FP32" id="74">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_409,Convolution_407" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22473652" size="512" precision="FP32" />
				<weights offset="22474164" size="262144" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_410" type="Clamp" precision="FP32" id="75">
			<data max="6" min="0" originalLayersNames="Clamp_410" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_420" type="Convolution" precision="FP32" id="76">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" originalLayersNames="Add_420,Convolution_418" output="256" pads_begin="1,1" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22736308" size="1024" precision="FP32" />
				<weights offset="22737332" size="1179648" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_421" type="Clamp" precision="FP32" id="77">
			<data max="6" min="0" originalLayersNames="Clamp_421" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_431" type="Convolution" precision="FP32" id="78">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_431,Convolution_429" output="546" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>546</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="23916980" size="2184" precision="FP32" />
				<weights offset="23919164" size="559104" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Transpose_433" type="Permute" precision="FP32" id="79">
			<data order="0,2,3,1" originalLayersNames="Transpose_433" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>546</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>546</dim>
				</port>
			</output>
		</layer>
		<layer name="Constant_434" type="Const" precision="I64" id="80">
			<data originalLayersNames="Constant_434" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="24478268" size="32" precision="I64" />
			</blobs>
		</layer>
		<layer name="Reshape_435" type="Reshape" precision="FP32" id="81">
			<data dim="" originalLayersNames="Reshape_435" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>546</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>54</dim>
					<dim>91</dim>
				</port>
			</output>
		</layer>
		<layer name="Transpose_437" type="Permute" precision="FP32" id="82">
			<data order="0,3,1,2" originalLayersNames="Transpose_437" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>54</dim>
					<dim>91</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>91</dim>
					<dim>1</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_451" type="Convolution" precision="FP32" id="83">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_451,Convolution_449" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24478300" size="512" precision="FP32" />
				<weights offset="24478812" size="131072" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_452" type="Clamp" precision="FP32" id="84">
			<data max="6" min="0" originalLayersNames="Clamp_452" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_462" type="Convolution" precision="FP32" id="85">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" originalLayersNames="Add_462,Convolution_460" output="256" pads_begin="1,1" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24609884" size="1024" precision="FP32" />
				<weights offset="24610908" size="1179648" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_463" type="Clamp" precision="FP32" id="86">
			<data max="6" min="0" originalLayersNames="Clamp_463" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_473" type="Convolution" precision="FP32" id="87">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_473,Convolution_471" output="546" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>546</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="25790556" size="2184" precision="FP32" />
				<weights offset="25792740" size="559104" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Transpose_475" type="Permute" precision="FP32" id="88">
			<data order="0,2,3,1" originalLayersNames="Transpose_475" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>546</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>546</dim>
				</port>
			</output>
		</layer>
		<layer name="Constant_476" type="Const" precision="I64" id="89">
			<data originalLayersNames="Constant_476" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="26351844" size="32" precision="I64" />
			</blobs>
		</layer>
		<layer name="Reshape_477" type="Reshape" precision="FP32" id="90">
			<data dim="" originalLayersNames="Reshape_477" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>546</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>91</dim>
				</port>
			</output>
		</layer>
		<layer name="Transpose_479" type="Permute" precision="FP32" id="91">
			<data order="0,3,1,2" originalLayersNames="Transpose_479" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>91</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>91</dim>
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_493" type="Convolution" precision="FP32" id="92">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" originalLayersNames="Add_493,Convolution_491" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="26351876" size="256" precision="FP32" />
				<weights offset="26352132" size="65536" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_494" type="Clamp" precision="FP32" id="93">
			<data max="6" min="0" originalLayersNames="Clamp_494" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="Add_504" type="Convolution" precision="FP32" id="94">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" originalLayersNames="Add_504,Convolution_502" output="128" pads_begin="0,0" pads_end="1,1" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="26417668" size="512" precision="FP32" />
				<weights offset="26418180" size="294912" precision="FP32" />
			</blobs>
		</layer>
		<layer name="Clamp_505" type="Clamp" precision="FP32" id="95">
			<data max="6" min="0" originalLayersNames="Clamp_505" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
